{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Shape of Everything",
    "home_page_url": "https://shapeof.com/",
    "feed_url": "https://shapeof.com/feed.json",
    "description": "A website mostly about Mac stuff, written by Gus Mueller",
    "author": {
        "name": "Gus Mueller"
    },
    "items": [
        {
            "id": "https://shapeof.com/archives/2023/9/cat_hicks_on_craft.html",
            "title": "Cat Hicks on Craft",
            "content_html": "<p><a href=\"https://www.drcathicks.com/post/on-craft\">This piece &quot;On Craft&quot; by Cat Hicks</a> really resonated with me:</p>\n<blockquote>\n<p>There is this thing I guess for me here, craft as communication and collaboration and creation, versus craft as weapon. Craft as fixing a table for everyone who will sit at it later versus craft as judging whose work gets to be seen as authentic and skilled. </p>\n</blockquote>\n",
            "date_published": "2023-09-06T09:13:20-07:00",
            "url": "https://shapeof.com/archives/2023/9/cat_hicks_on_craft.html"
        },
        {
            "id": "https://shapeof.com/archives/2023/9/acorn_7.4.3_released.html",
            "title": "Acorn 7.4.3 Released",
            "content_html": "<p><a href=\"https://flyingmeat.com/acorn/\">Acorn 7.4.3</a> is out, and it&#39;s a free update for anyone with an Acorn 7 license.</p>\n<p>This release is mostly about bug fixes, but I snuck in a couple of little things, one of which has been asked for a bunch of times over the years: the ability to know the number of pixels you&#39;ve got in a selection. The count shows up in the Selection palette right below the width and height fields.</p>\n<p>There&#39;s also a new &quot;New Auto Level / Straighten&quot; command, layered screenshot improvements, and a couple more things. You can read the gory details in the <a href=\"https://flyingmeat.com/acorn/releasenotes.html\">full release notes</a>.</p>\n<p>One more super geeky thing I&#39;ve added is a JavaScript Console:</p>\n<center><img src=\"https://shapeof.com/archives/2023/9/Acorn_743_JS_Console.png\" width=\"600px\" /></center>\n\n<p>This tool is really meant for folks developing plugins in Acorn, and it is only accessible from the Command Bar, but a part of me absolutely loves pointing out little things like this. I was just chatting with <a href=\"https://inessential.com\">Brent Simmons</a> the other day at Xcoders how you can&#39;t really spelunk in apps any more because of all the restrictions that are (justifiably) put on recent MacOS releases. While a console isn&#39;t exactly a spelunking tool, I still think it&#39;s kind of cool and fun and maybe someone will discover it accidently and that will inspire them to do stupid and entertaining things like we used to do back in the 10.x days.</p>\n<p>Anyway, here&#39;s a picture of some groovy flowers out of the 1970s, because I&#39;m still stuck on the ’74 theme for recent Acorn releases.</p>\n<center><img src=\"https://shapeof.com/archives/2023/9/groovy_70s.jpeg\" width=\"600px\" /></center>\n<br/><br/>",
            "date_published": "2023-09-25T12:54:15-07:00",
            "url": "https://shapeof.com/archives/2023/9/acorn_7.4.3_released.html"
        },
        {
            "id": "https://shapeof.com/archives/2023/10/how_i_stay_motivated_as_a_solo-creator.html",
            "title": "How Herman Martinus Stays Motivated as a Solo-Creator",
            "content_html": "<p>Herman Martinus: <a href=\"https://herman.bearblog.dev/how-i-stay-motivated-as-a-solo-creator/\">How I stay motivated as a solo-creator</a>:</p>\n<blockquote>\n<p>When you&#39;re working solo, however, there isn&#39;t a specific thing you have to do. No pre-set route to take. If I decide to not do any work today, no-one will notice. But if I continue doing so for too many days things start falling apart. Slowly at first, then rapidly, until everything I&#39;ve built comes toppling down around me.</p>\n</blockquote>\n<p>What Martinus describes in his post isn&#39;t too far off from my day to day routine.</p>\n",
            "date_published": "2023-10-05T14:51:28-07:00",
            "url": "https://shapeof.com/archives/2023/10/how_i_stay_motivated_as_a_solo-creator.html"
        },
        {
            "id": "https://shapeof.com/archives/2023/10/stu_maschwitz_on_log_video_recording_with_iphone_15_pro.html",
            "title": "Stu Maschwitz on ProRes Log Video Recording With iPhone 15 Pro",
            "content_html": "<p>Stu Maschwitz: <a href=\"https://prolost.com/blog/applelog\">Log is the “Pro” in iPhone 15 Pro</a>:</p>\n<blockquote>\n<p>The iPhone 15 Pro and Pro Max feature log video recording. This is a big deal, but there’s already some confusion about it. Where consumer devices and pro video overlap, that’s where the Prolost Signal gleams brightest in the night sky. So let’s get to work.</p>\n<p>First, what exactly is log? It’s short for logarithmic encoding, which is a math thing, but what does it mean to videographers?</p>\n<p>It really boils down to two things: Log is flat, and log is known.</p>\n</blockquote>\n<p>I&#39;m not really a video person, but I found this article super interesting (it helps that I know enough about color spaces to be dangerous).</p>\n<p>The new ProRes Log video format in the iPhone 15 looks great, and with the combo of USB-C and recording to external drives — well, it means more video folks are going to be grabbing an iPhone 15 to record with.</p>\n",
            "date_published": "2023-10-11T08:07:32-07:00",
            "url": "https://shapeof.com/archives/2023/10/stu_maschwitz_on_log_video_recording_with_iphone_15_pro.html"
        },
        {
            "id": "https://shapeof.com/archives/2023/10/five_watt_world_on_fender_japan.html",
            "title": "Five Watt World on Fender Japan",
            "content_html": "<p>five watt world has a great 18 minute video on the history of Fender guitars made in Japan : <a href=\"https://www.youtube.com/watch?v=9i_cNldBZvY\">Fender Japan: A Short History</a></p>\n<p>One of my favorite guitars, <a href=\"https://shapeof.com/archives/2023/10/milo.jpeg\">a &#39;62 Stratocaster reissue</a>, was made in Japan. It&#39;s always been exceptionally good for what I paid for it, and I can still remember the first time I plugged it into an amp and played it. There was just something special about it, and I couldn&#39;t believe someone would have traded it in (I got it used, and made an even trade with a more expensive guitar for the swap. I just had to have it).</p>\n<p>Years after I acquired the strat (and decades ago at this point), I was reading an article about older Japanese reissue strats, and that some folks were trying to pass them off as original 60&#39;s. There was really only one external sign on the guitar that gave it away - which was a &quot;Made in Japan&quot; sticker under the finish at the heal of the neck. Apparently people would try and remove it, but it was placed under the finish so it was impossible to remove without damaging the guitar.</p>\n<p>I walked over to my guitar, flipped it over, and saw right away that someone had tried to scratch off the &quot;Made in Japan&quot; sticker. It made me laugh.</p>\n<p>Sadly the neck warped sideways a number of years ago, so it&#39;s no longer &quot;original&quot;. I&#39;ve since put on a matching neck and still play it all the time.</p>\n",
            "date_published": "2023-10-30T09:12:57-07:00",
            "url": "https://shapeof.com/archives/2023/10/five_watt_world_on_fender_japan.html"
        },
        {
            "id": "https://shapeof.com/archives/2023/11/retrobatch_2.html",
            "title": "Retrobatch 2",
            "content_html": "<center><img src=\"https://flyingmeat.com/blog/archives/2023/11/rb2.png\" border=\"0\" alt=\"Retrobatch\" width=\"700\" /></center>\n\n<h3 id=\"retrobatch-2-is-out\"><a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch 2</a> is out!</h3>\n<p>In case you&#39;re not aware, <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch</a> is a node based batch image processor, which means you can mix, match, and combine different operations together to make the perfect workflow. It&#39;s kind of neat. And version 2 is even neater.</p>\n<p>Here&#39;s the quick stats for the impatient:</p>\n<p>Retrobatch 2 requires MacOS 12 or later and it runs on Apple Silicon or Intel. It comes in 2.5 flavors:</p>\n<ul>\n<li><strong>Retrobatch</strong> (regular): currently $19.99 one time fee. Comes with all 2.x upgrades.</li>\n<li><strong>Retrobatch Pro</strong>: currently a $39.99 one time fee (or $24.99 if you&#39;re upgrading from 1.x). Also comes with all 2.x upgrades. It has more &quot;Pro&quot; features (aka, wacky things with color profiles, JavaScript, and more).</li>\n<li><strong>Retrobatch Pro (App Store)</strong>: $24.99 a year with a free 7 day trial. It also has <a href=\"https://flyingmeat.com/retrobatch/docs-2.0/provsregular/#the-following-features-and-nodes-are-unavailable-on-the-app-store-version-of-retrobatch-pro\">some features missing</a> because of App Store restrictions - but that may not matter to you.</li>\n</ul>\n<p>This is the first time Retrobatch has been on the App Store, so this is … slightly exciting? We&#39;ll see what happens. It&#39;s also nice being able to offer upgrade pricing on my own store again without feeling like I&#39;m penalizing App Store folks.</p>\n<h3 id=\"guss-favorite-new-features\">Gus&#39;s Favorite New Features</h3>\n<p>The <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">full release notes are available</a>, but here&#39;s what I think are the coolest features:</p>\n<ul>\n<li><strong>Command Bar</strong>: This is just like the Command Bar in <a href=\"https://flyingmeat.com/acorn/\">Acorn</a>, but I find it way more useful in Retrobatch for adding new nodes to the canvas. I no longer search through the little catalog - I just type and press enter.</li>\n<li><strong>Dark Mode</strong>: It&#39;s nice? And it&#39;s about time it showed up?</li>\n<li><strong>Larger Previews</strong>: The new way to view large previews is super easy. Select a node(s), hit the spacebar. A sheet comes up with node properties on the left, and a large preview on the right. It&#39;s a great way to dial in node properties.</li>\n<li><strong>Super Resolution ML Scaling</strong> node: Retrobatch has a node which uses the <a href=\"https://github.com/dvlab-research/Simple-SR\">Beby-GAN</a> model to do 4x scaling of your images. This was a fun little project because the <a href=\"https://github.com/john-rocky/CoreML-Models#beby-gan\">original model</a> I used was over 60MB, but using Apple&#39;s coremltools I was able to <a href=\"https://gist.github.com/ccgus/f3aff7e3088a3c4aa50b4ee40288d462\">quantize it down</a> to just under 17MB. Machine learning models are awesome, but they can be pretty big. And going from a 32 bit model down to 8 bits didn&#39;t seem to impact the fidelity of what was generated.</li>\n<li><strong>Photos Export</strong> node: This node replaces the previous &quot;Image Library&quot; node because of deprecations by Apple (they want me to stop using older APIs). This new node is more refined and lets you export your photos from your Photos library, and even download full resolution images from iCloud. I have a couple of interesting samples in the documentation on how to use it:<ul>\n<li><a href=\"https://flyingmeat.com/retrobatch/docs/howto/#export-raw-images-from-photos-and-import-to-new-album-as-heic\">Export RAW Images From Photos and Import to New Album as HEIC</a>, which does what it sounds like.</li>\n<li><a href=\"https://flyingmeat.com/retrobatch/docs-2.0/howto/#export-photos-to-multiple-folders-with-size-limit-pro-only\">Export Photos To Multiple Folders With Size Limit</a>, which will pull out photos and sort them into multiple folders based on how big the folder is getting. In the sample, the folders made will never exceed 10MB. It was inspired by an <a href=\"https://atp.fm/556\">ATP episode</a> where Marco Arment wanted to write his photos library to optical disks.</li>\n</ul>\n</li>\n<li><strong>Acorn Maker</strong> node: It makes native layered Acorn images. Combine that with the updated screenshot node and you can make layered screenshots straight from Retrobatch.</li>\n<li><strong>Shortcuts Support</strong>: It&#39;s a simple implementation which lets you run workflows with gathered images, but since Shortcuts has system wide support, you can now make a workflow and run it straight from the Finder&#39;s Quick Actions menu.</li>\n</ul>\n<h3 id=\"updated-documentation\">Updated Documentation</h3>\n<p>The <a href=\"https://flyingmeat.com/retrobatch/docs-2.0/\">new documentation</a> has <a href=\"https://flyingmeat.com/retrobatch/docs-2.0/howto/\">more samples</a> than ever. There are so many things you can do with Retrobatch, and I really need to start showing those things off.</p>\n<p>I&#39;ve also started a little &quot;Technotes&quot; section where I hope to expand on little things in Retrobatch which are important to know about, but don&#39;t necessarily fit in the greater documentation.</p>\n<center>…</center>\n\n<p>Retrobatch is obviously not Flying Meat&#39;s most important app (<a href=\"https://flyingmeat.com/acorn/\">Acorn</a> would fill that role), but I really do like working on it and there&#39;s a bunch more ideas that I want to implement. I feel like Retrobatch is an app that the Mac needs, and it makes me incredibly happy to read all the nice letters I get from folks when they figure out how to use it in their daily work.</p>\n<p>Five years after Retrobatch 1 shipped, I&#39;m happy to see version 2 out in the world. And I can&#39;t wait to see what folks are going to do with it.</p>\n",
            "date_published": "2023-11-07T14:12:39-08:00",
            "url": "https://shapeof.com/archives/2023/11/retrobatch_2.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/1/40_years_of_the_macintosh.html",
            "title": "40 Years of the Macintosh",
            "content_html": "<p>Today marks the 40th anniversary since the <a href=\"https://youtu.be/1tQ5XwvjPmA?t=469\">introduction of the Macintosh</a>. I can&#39;t let it go by without saying <em>something</em>. After all, my current livelihood would be impossible without it.</p>\n<p>I&#39;ve been developing apps for the Mac for most of its life now. That&#39;s crazy. And the best thing about the Mac turning 40? I can easily see it going for at least another ten. It didn&#39;t always seem that way, but MacOS is an incredibly robust OS and so many applications couldn&#39;t be possible without it. How long will it go? Everything ends at some point, but the Mac just keeps on keeping on. I&#39;m hopeful and excited about its future.</p>\n<p>Happy Birthday little guy.</p>\n",
            "date_published": "2024-01-24T21:59:55-08:00",
            "url": "https://shapeof.com/archives/2024/1/40_years_of_the_macintosh.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/2/acorn_7.4.4_released.html",
            "title": "Acorn 7.4.4 Released",
            "content_html": "<p><a href=\"https://flyingmeat.com/acorn/\">Acorn 7.4.4</a> is out, and it&#39;s a free update for anyone with an Acorn 7 license.</p>\n<p><a href=\"https://flyingmeat.com/blog/archives/2023/9/acorn_7.4.3_released.html\">As previously mentioned</a>, I&#39;m not incrementing Acorn past the 7.4 number (&#39;74 was a good year for me). But that doesn&#39;t mean I&#39;m not adding new features, and this release has some. Here are some highlights straight from the <a href=\"https://flyingmeat.com/acorn/releasenotes.html\">release notes</a>:</p>\n<ul>\n<li><p><strong>Super Resolution ML resizing</strong>. This new option in the Image ▸ Resize Image… menu item lets you increase the size of your image up to 4x using Machine Learning. Or is it AI now? I don&#39;t know and don&#39;t care, but it&#39;s pretty awesome! It packs a ton of crazy statistics and math into a simple little dropdown menu. Give it a shot for your photos, you won&#39;t be disappointed. (Super Resolution is for MacOS 12 or later only).</p>\n</li>\n<li><p><strong>Stroke Selections!</strong> <em>Finally</em>. You can now perform this long requested feature via the Select menu, and even works with Magic Wand selections (MacOS 11 or later only). Change your stroke size, blending, anti-alias or not, and even add a fill.</p>\n</li>\n<li><p>You can now convert <strong>Magic Wand selections to shape layers</strong>. This is also super awesome! If you&#39;ve got a fun outline of something that you want to convert into a shape, this is the way. (MacOS 11 or later only).</p>\n</li>\n<li><p><strong>New &quot;Simple Film Grain&quot; filter</strong>, which will add a grainy overlay to your image. Just like Grandpa&#39;s photos used to have.</p>\n</li>\n</ul>\n<h3 id=\"other-interesting-things\">Other Interesting things:</h3>\n<ul>\n<li>The Text Palette now shows what the font looks like in the font pop-up menus.</li>\n<li>Holding down the backslash key (&#39;\\&#39;) will temporarily switch off any layer filters you have on selected layers.</li>\n<li>The tool palette will now dim tools that you can&#39;t use in modal operations (such as when cropping, scaling and rotating, and similar operations).</li>\n<li>Neat new trick with the Shortcuts Crop action: If you choose &quot;Custom&quot; as the position and put in negative values, the canvas will expand instead of shrink. A negative X value will increase the size on the left, Y on the bottom, Width on the right, and Height for the top.</li>\n<li>Various little improvements to the File Info window, including shortcuts (Command 1-4) to switch between the sections.</li>\n<li>Double clicking on a non-bézier shape with the anchor select tool will now convert it to a bézier shape (previously this only worked with the move tool (shortcut key &#39;v&#39;).</li>\n<li>A new Shortcuts action to open images in Acorn.</li>\n<li>Various improvements to Acorn&#39;s SVG importer.</li>\n<li>The AppleScript command do filter name &quot;Your Filter Preset Name Here&quot; will now work with filter presets as well. This is in addition to the call filter preset with name command. There is a story behind this. It isn&#39;t very good.</li>\n</ul>\n<p>And of course, I have squashed some bugs as well, and you can <a href=\"https://flyingmeat.com/acorn/releasenotes.html\">read about those in the full release notes</a>.</p>\n<p><a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch</a> has been getting most of my attention lately (the <a href=\"https://flyingmeat.com/download/latest/#retrobatch\">upcoming 2.1 release includes LUT support</a>!) but working on Acorn always brings joy, and I have lots more fun things planned for in the future.</p>\n<center><img src=\"https://shapeof.com/archives/2023/9/groovy_70s.jpeg\" width=\"600px\" /></center>\n<br/><br/>",
            "date_published": "2024-02-22T10:29:41-08:00",
            "url": "https://shapeof.com/archives/2024/2/acorn_7.4.4_released.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/3/retrobatch_2.1.html",
            "title": "Retrobatch 2.1",
            "content_html": "<p><a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch 2.1</a> is out, and it&#39;s a free update for 2.x license holders.</p>\n<p>Here&#39;s what is new and awesome:</p>\n<ul>\n<li><strong>A new Look up Table (LUT) node!</strong> (This is my favorite).<br>The LUT node can be used to quickly and easily alter the color and tone of your images. LUTs can be used to create a wide range of effects, from subtle color adjustments to dramatic stylistic changes — it&#39;s like a pre-programmed filter, but with more flexibility and control. Use one of Retrobatch&#39;s LUT presets, or <a href=\"https://www.google.com/search?client=safari&amp;rls=en&amp;q=free+luts+for+images&amp;ie=UTF-8&amp;oe=UTF-8\">download additional LUTs</a> that emulate film stocks, create specific moods (like warm, cool, or vintage), or simply enhance the natural colors in your image.<br>You can also adjust the opacity and blending mode of the LUT. Use a grayscale LUT and then dial back the opacity to create some dramatic effects in your images. (Retrobatch Pro only)</li>\n<li><strong>New &quot;Tile Chop&quot; node</strong> which will take an image and split it up into multiple images based on a width and height set in its properties.</li>\n<li><strong>New &quot;Camera Capture&quot; node</strong> which uses your Mac&#39;s built in camera to take a photo (Retrobatch Pro only).</li>\n<li>Photos Export now has an option to export the Current, Unadjusted, or Original versions of your Photos Library images.\n*New &quot;Auto Process&quot; option in the RAW Import node. This lets you skip the fiddly options and just lets Retrobatch make the best guess at how the image should be processed.</li>\n<li>Two new nodes for renaming files. <strong>&quot;File Rename&quot;</strong> which will take one search string and replace it with another, and <strong>&quot;Web Safe Rename&quot;</strong> which will take a sequence of characters and then replace those with a given string. This is handy for tasks where you need to take out special characters or spaces from your images to make them easier for handling on the web.</li>\n<li>There&#39;s a new Advanced tab in Preferences, with some new options:<ul>\n<li>A new &quot;Default Write Folder&quot; that will be used anytime you add a Write node.</li>\n<li>A &quot;Clear JavaScript console when a workflow runs&quot; option, which is useful for plugin authors.</li>\n<li>A &quot;Allow unknown file types&quot; option, which can be used to load ancient file types that MacOS no longer recognizes (Pro only). Find out more about this preference if you find it intriguing.</li>\n</ul>\n</li>\n</ul>\n<p>There are additional changes and bug fixes of course. You can read all the <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">gory details from the release notes</a>.</p>\n<p>You can use the Retrobatch ▸ Check for Updates… menu item to get the latest release, or if you have downloaded it via the App Store you can update it from there.</p>\n<p>And of course, I&#39;ve always got more planned so look for more fun stuff in the future.</p>\n",
            "date_published": "2024-03-20T11:19:32-07:00",
            "url": "https://shapeof.com/archives/2024/3/retrobatch_2.1.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/5/2024_youth_regional_championships.html",
            "title": "2024 Youth Regional Championships",
            "content_html": "<p>YouTube: <a href=\"https://www.youtube.com/watch?v=tOoUbMykC74\">2024 Youth Regional Championships | Vertical World Climbing Team</a>.</p>\n<p>My fav climbing gym just put up a little video from the regional campionship they had this past weekend. It was a fun event, where my daughter got to participate and I got a chance to lead belay a bunch of the older kids.</p>\n<p>There&#39;s a ton of work that goes into setting up all these climbing routes, and this short film only scratches the surface.</p>\n",
            "date_published": "2024-05-16T14:00:39-07:00",
            "url": "https://shapeof.com/archives/2024/5/2024_youth_regional_championships.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/7/10_commandments_of_guitar_playing.html",
            "title": "10 Commandments of Guitar Playing",
            "content_html": "<p>For the guitar players out there, I&#39;d like to share <a href=\"https://blog.wfmu.org/freeform/2009/03/captain-beefhearts-10-commandments-of-guitar-playing.html\">Captain Beefheart&#39;s 10 Commandments of Guitar Playing</a>.</p>\n<blockquote>\n<p>Never point your guitar at anyone<br>Your instrument has more clout than lightning. Just hit a big chord then run outside to hear it. But make sure you are not standing in an open field.</p>\n</blockquote>\n",
            "date_published": "2024-07-29T10:56:05-07:00",
            "url": "https://shapeof.com/archives/2024/7/10_commandments_of_guitar_playing.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/8/dead_for_a_while_now.html",
            "title": "The Canary Has Been Dead for a Long Time Now",
            "content_html": "<p>Jason Snell at Six Colors: <a href=\"https://sixcolors.com/post/2024/08/apples-permissions-features-are-out-of-balance/\">Apple’s permissions features are out of balance</a>:</p>\n<blockquote>\n<p>In an attempt to protect Mac users from getting themselves into trouble, Apple introduced numerous permissions pop-ups into macOS Catalina. In the years since, the company has accelerated its approach, adding ever more situations where users must grant specific permission. Often multiple times, in multiple places. (It can be magnified by migrating to a new Mac and getting those requests all at once.)  </p>\n<p>…<br/></p>\n<p>Now comes the news that things may be getting worse, not better. 9to5Mac reports that macOS Sequoia beta has introduced a new prompt that doesn’t allow a user to permanently grant permission, but requires an occasional re-authorization.</p>\n</blockquote>\n<p>Acorn &quot;records the screen&quot; to sample pixels in other apps when you use the color loupe. This is great if you see a color in a Safari window that you&#39;d like to grab, even if you do have to deal with a scary warning (once) from MacOS. At least it was only once, until now.</p>\n<p>I&#39;ve been running the Sequoia betas for a while now and I thought it was a bug that I was having to open up System Settings every other day to grant this permission yet again. Apparently this is as designed (and since I rebuild Acorn from source multiple times a day it seems to trigger something in MacOS Sequoia that says I need to give permission yet again).</p>\n<p><a href=\"https://daringfireball.net/linked/2024/08/07/macos-15-sequoia-weekly-permission-prompts\">John Gruber</a> at Daring Fireball:</p>\n<blockquote>\n<p>I think it shows just how much care and thoughtfulness went into turning up the dial on these nags that the button label incorrectly capitalizes the “to” in “Continue To Allow”. You can say, well, that’s a little thing. But that’s exactly the sort of little thing that almost never shipped from Apple, even in beta, until the last few years.</p>\n</blockquote>\n<p>This is sad, but not unsurprising given the trajectory of things lately. And if you look closely, you can still see bits of yellow feather intermixed with the rest of the decomposing body.</p>\n",
            "date_published": "2024-08-09T11:49:20-07:00",
            "url": "https://shapeof.com/archives/2024/8/dead_for_a_while_now.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/9/i_finally_climbed_flyboys.html",
            "title": "I Finally Climbed Flyboys",
            "content_html": "<center><img class=\"bb\" style=\"\" src=\"https://shapeof.com//archives/2024/9/flyboys_top.jpeg\" alt=\"Topping out on Flyboys, an 1800ft climb. That is not me in this photo.\"  width=\"650\" /><div style=\"color: #666; padding-top: 2px;\">Topping out on Flyboys, an 1800ft climb. That is not me in this photo.</div></center>\n\n<p>This past Saturday I went up <a href=\"https://www.mountainproject.com/route/113665378/flyboys\">Flyboys</a>, an 18 pitch, 1800 ft, climb in <a href=\"https://www.google.com/maps/place/Mazama,+WA+98862/@48.5924388,-120.4253974,7234m/data=!3m2!1e3!4b1!4m6!3m5!1s0x5483537fbb9e3e41:0x73f3b923e86b8876!8m2!3d48.5924412!4d-120.4047978!16zL20vMDJxcnJx?entry=ttu&amp;g_ep=EgoyMDI0MDkxMS4wIKXMDSoASAFQAw%3D%3D\">Mazama</a>, Washington. I lead every pitch with my climbing partner Caitlin handling the belaying.</p>\n<p>It was pretty awesome. Maybe even epic.</p>\n<p>Flyboys has been on my todo list for a long time as it&#39;s a pretty moderate route, with easy access, and a ton of bolts. And it&#39;s super long, which is its main attraction.</p>\n<p>We woke up at 5:30 am I was delighted to see that there was only one party ahead of us at the parking lot — I really didn&#39;t want to get stuck behind multiple slow parties. After a 30 minute approach there were at least 10 more cars in the parking lot. It was going to be a busy day here.</p>\n<p>At 6:30 we started climbing.</p>\n<center><img class=\"bb\" style=\"\" src=\"https://shapeof.com//archives/2024/9/flyboys_conga.jpeg\" alt=\"A conga line of folks waiting to get on the climb.\"  width=\"650\" /><div style=\"color: #666; padding-top: 2px;\">A conga line of folks waiting to get on the climb.</div></center>\n\n<p>Pitch after pitch, belay after belay, we slowly made our way up. Sadly we didn&#39;t get to go as fast as I would have liked, as the party ahead of us was having issues with the climbing (it might have been a little bit above their pay grade). But they were super nice folks so we cheered them on, sent positive vibes, and chatted quite a bit with both them and the party behind us.</p>\n<p>Eventually however they got stuck around pitch 12 and asked for some help. We hatched a little plan where I would lead the route and then Caitlin would follow me and place a rope past the section they couldn&#39;t manage (climber speak: Caitlin put draws on bolts 3 and 4 so they were essentially on top rope through the crux). This way they could still lead most of the route, but the tricky part would be well protected and they could cheat their way through if necessary.</p>\n<p>Side note: a lot of climbing is mental. And when you&#39;re 1000 ft above where you started and have been climbing for hours, your brain can act funky even if you&#39;re staying hydrated and eating the right food. I think this was the problem they were facing. Had this pitch been earlier I bet they could have made it.</p>\n<p>So now we were the first party!</p>\n<center><img class=\"bb\" style=\"\" src=\"https://shapeof.com//archives/2024/9/flyboys_gus_and_caitlin.jpeg\" alt=\"Myself and Caitlin somewhere up the side of a cliff.\"  width=\"650\" /><div style=\"color: #666; padding-top: 2px;\">Myself and Caitlin somewhere up the side of a cliff.</div></center>\n\n<p>With nobody to worry about ahead of us I could just climb as fast as I&#39;d like and setup the belay anchors without dealing with another party, and it was just wonderful. I was all smiles.</p>\n<p>Party #3 also skipped ahead of the previous group, and caught up with us after a bit. But it was all chill as we were mostly climbing at the same pace.</p>\n<center><img class=\"bb\" style=\"\" src=\"https://shapeof.com//archives/2024/9/flyboys_gus_feet.jpeg\" alt=\"The view from the top of pitch 18 as I belayed Caitlin up.\"  width=\"650\" /><div style=\"color: #666; padding-top: 2px;\">The view from the top of pitch 18 as I belayed Caitlin up.</div></center>\n\n<p>We finished pitch 18&#39; at 5:21pm, for a total time of 10:23:12. This was roughly double what I think we could have done — but the weather was perfect and what else were we going to do that day? Besides eat pizza, because we did do that.</p>\n<p>Some fun Apple Watch stats:</p>\n<center>\n<img src=\"https://shapeof.com/archives/2024/9/flyboy_move.png\" alt=\"watch move stats\" width=\"240\" />\n<img src=\"https://shapeof.com/archives/2024/9/flyboys_exercise.png\" alt=\"watch exercise stats\"  width=\"240\" />\n</center>\n\n<p>I&#39;m really curious what the spike at 10am was. If I do this climb again (I&#39;m sure I will) I&#39;ll take some notes.</p>\n",
            "date_published": "2024-09-16T10:50:37-07:00",
            "url": "https://shapeof.com/archives/2024/9/i_finally_climbed_flyboys.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/9/six_colors_turns_ten.html",
            "title": "Six Colors Turns Ten",
            "content_html": "<blockquote>\n<p>I’m doing exactly what I dreamed of doing ten years ago. I got to be home when my son was in middle school and when both my kids were in high school. I get to collaborate on projects with all sorts of great people, including Dan, Myke Hurley and Stephen Hackett, and the entire Incomparable gang.</p>\n</blockquote>\n<p>Congrats to Jason (and Dan!) on making Six Colors awesome for ten years, and more to come.</p>\n",
            "date_published": "2024-09-16T15:51:50-07:00",
            "url": "https://shapeof.com/archives/2024/9/six_colors_turns_ten.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/9/is_safari_now_a_bad_web_browser.html",
            "title": "Is Safari Now a Bad Web Browser?",
            "content_html": "<p>Nicolas Magand:</p>\n<blockquote>\n<p>Today, after nearly 20 years of loyalty to Safari, I’m considering switching to another default browser on my personal computer. I mean, why is it so hard to watch a YouTube video without hiccups, and why can I only choose from a selection of 4 search engines, including three Bing-based?</p>\n<p>…</p>\n<p>Apple needs to spend more resources on their browser, and find new ambitions for it now that it will be more challenged on iPhones and iPads. The world needs a strong, well-funded alternative to Chrome.</p>\n</blockquote>\n<p>Safari has been pretty sketchy for me as well lately. And frequently videos in YouTube will pause until I move my cursor around (though audio will still play). I&#39;ve been contemplating moving to Chrome more and more.</p>\n",
            "date_published": "2024-09-18T11:09:44-07:00",
            "url": "https://shapeof.com/archives/2024/9/is_safari_now_a_bad_web_browser.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/9/iphone_battery_life_after_a_year_at_80.html",
            "title": "My iPhone Battery Life After a Year at 80% Charge Limit",
            "content_html": "<p>Juli Clover at MacRumors:</p>\n<blockquote>\n<p>With the iPhone 15 models that came out last year, Apple added an opt-in battery setting that limits maximum charge to 80 percent. The idea is that never charging the iPhone above 80 percent will increase battery longevity, so I kept my ‌iPhone‌ at that 80 percent limit from September 2023 to now, with no cheating.</p>\n<p>…</p>\n<p>My ‌iPhone 15‌ Pro Max battery level is currently at 94 percent with 299 cycles</p>\n</blockquote>\n<p>Via <a href=\"https://daringfireball.net/linked/2024/09/24/clover-iphone-15-battery-limit\">John Gruber</a>, who&#39;s stats are &quot;max capacity: 89 percent, 344 charge cycles&quot;.</p>\n<p>I kept my phone at 80% charge for most of the year. There were 4-5 times where I let it charge to 100% for things like camping trips or long climbing days. I never cary an extra battery (with the exception of camping where there was no power), and I don&#39;t think I once depleted my phone. With a handful of exceptions, I charge via MagSafe.</p>\n<p>My day one iPhone 15 Pro stats are: max capacity: 100%, cycle count: 229.</p>\n<p>Am I an outlier, or are Gruber and Clover?</p>\n",
            "date_published": "2024-09-25T11:27:13-07:00",
            "url": "https://shapeof.com/archives/2024/9/iphone_battery_life_after_a_year_at_80.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/11/apple_buys_pixelmator.html",
            "title": "Apple Buys Pixelmator",
            "content_html": "<p>So I didn&#39;t see that one coming.</p>\n<p>John Gruber has a good take over at Daring Fireball: <a href=\"https://daringfireball.net/linked/2024/11/01/pixelmator-apple\">Pixelmator Acquired by Apple; Future of Their Apps Uncertain</a>.</p>\n<p><a href=\"https://flyingmeat.com/acorn/\">Acorn</a> and Pixelmator came out 15 days apart from each other in 2007, and the target market between the two has always overlapped. But even with that I&#39;ve always been on good terms with the Pixelmator folks. Any time we were both attending WWDC, we would meet up and complain about image APIs or just chat over lunch.</p>\n<p>The other major player in this category is <a href=\"https://affinity.serif.com/en-us/photo/\">Affinity</a>, which was purchased by <a href=\"https://www.canva.com\">Canva</a> in March of this year. So it feels strange that Acorn is now effectively the only independent Mac image editor from that era.</p>\n<p>I have no inside information on what Apple is going to do with Pixelmator. Will it be discontinued? Will it be part of an Apple One subscription tier? Will it be part of the OS now or folded into Photos? Was this purely a talent grab?</p>\n<p>Time will tell.</p>\n<p>But today I woke up, and got to work on Acorn. And I&#39;ll do the same tomorrow and the day after that.</p>\n<p>I enjoy what I work on and I plan on doing it for many years to come. And I truly value my independence. I love being able to work on what I want, and when I want to.</p>\n<p>Good things are happening to Acorn these days. I&#39;m wrapping up some great new features in a new release, and if you&#39;d like to test them out, <a href=\"https://flyingmeat.com/acorn/acbeta.html\">let me know</a>.</p>\n",
            "date_published": "2024-11-04T11:30:08-08:00",
            "url": "https://shapeof.com/archives/2024/11/apple_buys_pixelmator.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/11/ken_white_thoughts_the_day_after.html",
            "title": "Ken White: And Yet It Moves",
            "content_html": "<p>Ken White (aka, Popehat): <a href=\"https://www.popehat.com/p/and-yet-it-moves\">And Yet It Moves</a>:</p>\n<blockquote>\n<p>Trump won yesterday, as I feared he would. I firmly believe America — and likely the world — will get significantly worse for at least a generation, probably more. I’ll spare you, for now, the why. Frankly, I think you either already accept it or will never accept it. The things I care about, like the rule of law and equality before it, freedom of religion, freedom of speech, free trade in service of free people, relative prosperity, protection of the weak from the strong, truth, and human dignity are all going to suffer. Bullies and their sycophants and apologists will thrive.</p>\n<p>What should we do?</p>\n<p>I have a few thoughts.</p>\n</blockquote>\n",
            "date_published": "2024-11-06T13:24:21-08:00",
            "url": "https://shapeof.com/archives/2024/11/ken_white_thoughts_the_day_after.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/11/acorn_retrobatch_and_gus_updates.html",
            "title": "Acorn, Retrobatch, and Gus Updates",
            "content_html": "<p>I&#39;ve just pushed up <a href=\"https://flyingmeat.com/acorn/\">Acorn 7.4.6</a>, which is about bug fixes. Specifically Quick Look fixes for MacOS 15 Sequoia (which was kind of tricky to get done right). If you&#39;re on Sequoia, make sure to grab this version.</p>\n<p>I&#39;ve also pushed up <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch 2.2</a>, which has a new <a href=\"https://flyingmeat.com/retrobatch/docs-2.0/csv/\">CSV Reader node</a>. It&#39;s basically like mail merge, but for images. Need to make 150 custom invitations as JPEGs for your Grandma&#39;s 100th birthday? This is a good way to do it.</p>\n<p>Also included in RB 2.2 is a new node called &quot;<a href=\"https://flyingmeat.com/retrobatch/docs-2.0/technotes/RBTN005/\">Dynamic Image Overlay</a>&quot; which makes it possible to insert unique (or randomized) images for each image processed in Retrobatch. When used in conjunction with the new CSV node, you can add custom images to your birthday invitations. Full release notes for Retrobatch 2.2 are <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">available</a>.</p>\n<p>And finally, Gus Mueller 50.0 was released today. Besides pushing out software updates, this updated build will be heading to the climbing gym to ascend 50 routes in a day, about 2,500ft of vertical total. We&#39;ll see if he survives or not. Version 50.00273 might regret it.</p>\n<p><strong>Update</strong>:\n51 climbs were completed. It was a mix of lead, top rope, and auto-belay. I really wanted to throw in some hard ones, but after about 20 climbs… well the smaller holds on even the 11s were getting tough to hold on to, even though I could pull overhanging jugs just fine. So only a single 12a was done, but it was my last climb and one of the hardest.</p>\n<p>Also a big hug and thank you to Caitlin who took time off work to <a href=\"https://www.google.com/search?client=safari&amp;rls=en&amp;q=what+is+belaying+in+rock+climbing&amp;ie=UTF-8&amp;oe=UTF-8\">belay</a> me today. It would have been 50 super boring auto belays without you.</p>\n<p>Stats!  </p>\n<p>5.7: 6 top rope<br>5.8: 6 top rope, 1 lead<br>5.9: 11 top rope, 1 lead<br>10a: 4 lead<br>10b: 3 top rope, 2 lead<br>10c: 3 top rope, 4 lead<br>10d: 1 top rope, 1 lead<br>11a: 5 top rope, 2 lead<br>12a: 1 top rope   </p>\n<p>My watch says I burned over 1.8k calories, in two sessions, in about a total of 4 hours. I also ate a whole Detroit style pizza and a burrito. It was a good birthday, and I didn&#39;t fall on a single route.</p>\n",
            "date_published": "2024-11-11T08:54:20-08:00",
            "url": "https://shapeof.com/archives/2024/11/acorn_retrobatch_and_gus_updates.html"
        },
        {
            "id": "https://shapeof.com/archives/2024/11/apple_ads_and_trust_and_privacy.html",
            "title": "Apple Ads, Trust, Privacy, and a Premium Experience",
            "content_html": "<p>Axios: <a href=\"https://www.axios.com/2024/11/19/apple-news-ads-direct-sales-publishers\">Apple is selling Apple News ads directly for the first time</a>.</p>\n<blockquote>\n<p>Apple has started selling its own advertising inventory for Apple News, two sources familiar with the effort told Axios. It&#39;s pitching new ad units that it hopes will maximize revenue for itself and its publishing partners.</p>\n</blockquote>\n<p>I&#39;ve been meaning to write about this for a while now, and since this popped up on Axios, now is a good time as ever. So here are my very brief thoughts.</p>\n<p>I really think Apple should get out of the ads business, starting with the App Store. I find it corrupting, ugly, distasteful, and most of all an anti-premium experience.</p>\n<p>Apple has always tried to project a premium experience, and seeing ads in the App Store just smells of desperation to me. I don&#39;t understand why they would want or need them? Apple already takes a commission from apps, and seemingly makes a good amount of money doing so. Having dumb ads feels petty and continues to breed a feeling that Apple will try to make any amount of money any time they can. Can&#39;t they just sit back and make something nice without squeezing every dime out of it?</p>\n<p>And I, along with many other people, associate ads with tracking. Why mix that in at all when the App Store already has a reputation for harboring scammy apps?</p>\n<p>I wish they&#39;d just stop. It&#39;s damaging to their reputation and I don&#39;t think having ads is worth whatever revenue they are generating from it.</p>\n<p>Via <a href=\"https://daringfireball.net/linked/2024/11/20/apple-selling-apple-news-ads\">Daring Fireball</a>.</p>\n",
            "date_published": "2024-11-20T11:23:15-08:00",
            "url": "https://shapeof.com/archives/2024/11/apple_ads_and_trust_and_privacy.html"
        }
    ]
}

